#+FILETAGS: REFILE
* CANCELLED test test						  :CANCELLED:
  CLOSED: [2014-01-09 Thu 18:45]
  - State "CANCELLED"  from "TODO"       [2014-01-09 Thu 18:45] \\
    done with test
  :LOGBOOK:
  CLOCK: [2014-01-09 Thu 17:06]--[2014-01-09 Thu 17:08] =>  0:02
  :END:
[2014-01-09 Thu 17:06]
   Added
* CANCELLED							  :CANCELLED:
  CLOSED: [2014-01-09 Thu 18:46]
  - State "CANCELLED"  from "TODO"       [2014-01-09 Thu 18:46] \\
    dtest
  :LOGBOOK:
  CLOCK: [2014-01-09 Thu 17:08]--[2014-01-09 Thu 17:10] =>  0:02
  :END:
   Added [2014-01-09 Thu 17:08]
* CANCELLED							  :CANCELLED:
  CLOSED: [2014-01-09 Thu 18:46]
  - State "CANCELLED"  from "TODO"       [2014-01-09 Thu 18:46] \\
    done test
  :LOGBOOK:
  CLOCK: [2014-01-09 Thu 17:10]--[2014-01-09 Thu 17:11] =>  0:01
  :END:
   [2014-01-09 Thu 17:10]
[[file:~/.emacs.d/init.el::%3B%3B%20Capture%20mode%20now%20handles%20automatically%20clocking%20in%20and%20out%20of%20a%20capture%20task.%20This%20all%20works%20out%20of%20the%20box%20now%20without%20special%20hooks.%20When%20I%20start%20a%20capture%20mode%20task%20the%20task%20is%20clocked%20in%20as%20specified%20by%20:clock-in%20t%20and%20when%20the%20task%20is%20filed%20with%20C-c%20C-c%20the%20clock%20resumes%20on%20the%20original%20clocking%20task.][file:~/


.emacs.d/init.el::;; Capture mode now handles automatically clocking in and out of a capture task. This all works out of the box now without special hooks. When I start a capture mode task the task is clocked in as specified by :clock-in t and when the task is filed with C-c C-c the clock resumes on the original clocking task.]]
* CANCELLED							  :CANCELLED:
  CLOSED: [2014-01-09 Thu 18:46]
  - State "CANCELLED"  from "TODO"       [2014-01-09 Thu 18:46] \\
    done
  :LOGBOOK:
  CLOCK: [2014-01-09 Thu 17:11]--[2014-01-09 Thu 17:12] =>  0:01
  :END:
  [2014-01-09 Thu 17:11]
[[file:~/.emacs.d/init.el]]
* CANCELLED							  :CANCELLED:
  CLOSED: [2014-01-09 Thu 18:46]
  - State "CANCELLED"  from "TODO"       [2014-01-09 Thu 18:46] \\
    done
  [2014-01-09 Thu 17:18]
  [[file:~/.emacs.d/init.el::"*%20NEXT%20%25?\n%20%25U\n%20%25a\n%20SCHEDULED:%20%25(format-time-string%20\"<%25Y-%25m-%25d%20%25a%20.%2B1d/3d>\")\n%20:PROPERTIES:\n%20:STYLE:%20habit\n%20:REPEAT_TO_STATE:%20NEXT\n%20:END:\n"))))][file:~/.emacs.d/init.el::"* NEXT %?\n %U\n %a\n SCHEDULED: %(format-time-string \"<%Y-%m-%d %a .+1d/3d>\")\n :PROPERTIES:\n :STYLE: habit\n :REPEAT_TO_STATE: NEXT\n :END:\n"))))]]
* NOTE 
  :LOGBOOK:
  CLOCK: [2014-01-09 Thu 17:18]--[2014-01-09 Thu 17:19] =>  0:01
  :END:
  [2014-01-09 Thu 17:18]
  [[file:~/.emacs.d/org/refile.org::*]]
* MEETING with  :MEETING:
  [2014-01-09 Thu 17:19]
* PHONE  :PHONE:
  :LOGBOOK:
  CLOCK: [2014-01-09 Thu 17:19]--[2014-01-09 Thu 17:21] =>  0:02
  :END:
[2014-01-09 Thu 17:19]
* PHONE  :PHONE:
  :LOGBOOK:
  :END:
  [2014-01-09 Thu 17:21]
* NOTE 
  [2014-01-24 Fri 18:10]
  [[file:~/.emacs.d/init.el::"*%20NOTE%20%25?\n%20%25U\n"%20:clock-resume%20t)][file:~/.emacs.d/init.el::"* NOTE %?\n %U\n" :clock-resume t)]]
* NOTE 
  [2014-01-24 Fri 18:10]
